FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32F103_IAR/STM32F10xFWLib/inc/stm32f10x_tim1.h
/******************** (C) COPYRIGHT 2007 STMicroelectronics ********************
* File Name          : stm32f10x_tim1.h
* Author             : MCD Application Team
* Date First Issued  : 09/29/2006
* Description        : This file contains all the functions prototypes for the
*                      TIM1 firmware library.
********************************************************************************
* History:
* 04/02/2007: V0.2
* mm/dd/yyyy: V0.1
* 09/29/2006: V0.01
********************************************************************************
* THE PRESENT SOFTWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F10x_TIM1_H
#define __STM32F10x_TIM1_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_map.h"

/* Exported types ------------------------------------------------------------*/

/* TIM1 Time Base Init structure definition */
typedef struct
{
    u16 TIM1_Prescaler;
    u16 TIM1_CounterMode;
    u16 TIM1_Period;
    u16 TIM1_ClockDivision;
    u8 TIM1_RepetitionCounter;
} TIM1_TimeBaseInitTypeDef;

/* TIM1 Output Compare Init structure definition */
typedef struct
{
    u16 TIM1_OCMode;
    u16 TIM1_OutputState;
    u16 TIM1_OutputNState;
    u16 TIM1_Pulse;
    u16 TIM1_OCPolarity;
    u16 TIM1_OCNPolarity;
    u16 TIM1_OCIdleState;
    u16 TIM1_OCNIdleState;
} TIM1_OCInitTypeDef;

/* TIM1 Input Capture Init structure definition */
typedef struct
{
    u16 TIM1_Channel;
    u16 TIM1_ICPolarity;
    u16 TIM1_ICSelection;
    u16 TIM1_ICPrescaler;
    u8 TIM1_ICFilter;
} TIM1_ICInitTypeDef;

/* BDTR structure definition */
typedef struct
{
    u16 TIM1_OSSRState;
    u16 TIM1_OSSIState;
    u16 TIM1_LOCKLevel;
    u16 TIM1_DeadTime;
    u16 TIM1_Break;
    u16 TIM1_BreakPolarity;
    u16 TIM1_AutomaticOutput;
} TIM1_BDTRInitTypeDef;

/* Exported constants --------------------------------------------------------*/
/* TIM1 Output Compare and PWM modes ----------------------------------------*/
#define TIM1_OCMode_Timing      ( ( u16 ) 0x0000 )
#define TIM1_OCMode_Active      ( ( u16 ) 0x0010 )
#define TIM1_OCMode_Inactive    ( ( u16 ) 0x0020 )
#define TIM1_OCMode_Toggle      ( ( u16 ) 0x0030 )
#define TIM1_OCMode_PWM1        ( ( u16 ) 0x0060 )
#define TIM1_OCMode_PWM2        ( ( u16 ) 0x0070 )

#define IS_TIM1_OC_MODE( MODE )           \
    ( ( MODE == TIM1_OCMode_Timing ) ||   \
      ( MODE == TIM1_OCMode_Active ) ||   \
      ( MODE == TIM1_OCMode_Inactive ) || \
      ( MODE == TIM1_OCMode_Toggle ) ||   \
      ( MODE == TIM1_OCMode_PWM1 ) ||     \
      ( MODE == TIM1_OCMode_PWM2 ) )

#define IS_TIM1_OCM( MODE )                   \
    ( ( MODE == TIM1_OCMode_Timing ) ||       \
      ( MODE == TIM1_OCMode_Active ) ||       \
      ( MODE == TIM1_OCMode_Inactive ) ||     \
      ( MODE == TIM1_OCMode_Toggle ) ||       \
      ( MODE == TIM1_OCMode_PWM1 ) ||         \
      ( MODE == TIM1_OCMode_PWM2 ) ||         \
      ( MODE == TIM1_ForcedAction_Active ) || \
      ( MODE == TIM1_ForcedAction_InActive ) )
/* TIM1 One Pulse Mode ------------------------------------------------------*/
#define TIM1_OPMode_Single        ( ( u16 ) 0x0001 )
#define TIM1_OPMode_Repetitive    ( ( u16 ) 0x0000 )

#define IS_TIM1_OPM_MODE( MODE )        \
    ( ( MODE == TIM1_OPMode_Single ) || \
      ( MODE == TIM1_OPMode_Repetitive ) )

/* TIM1 Channel -------------------------------------------------------------*/
#define TIM1_Channel_1    ( ( u16 ) 0x0000 )
#define TIM1_Channel_2    ( ( u16 ) 0x0001 )
#define TIM1_Channel_3    ( ( u16 ) 0x0002 )
#define TIM1_Channel_4    ( ( u16 ) 0x0003 )

#define IS_TIM1_CHANNEL( CHANNEL )     \
    ( ( CHANNEL == TIM1_Channel_1 ) || \
      ( CHANNEL == TIM1_Channel_2 ) || \
      ( CHANNEL == TIM1_Channel_3 ) || \
      ( CHANNEL == TIM1_Channel_4 ) )

#define IS_TIM1_PWMI_CHANNEL( CHANNEL ) \
    ( ( CHANNEL == TIM1_Channel_1 ) ||  \
      ( CHANNEL == TIM1_Channel_2 ) )

#define IS_TIM1_COMPLEMENTARY_CHANNEL( CHANNEL ) \
    ( ( CHANNEL == TIM1_Channel_1 ) ||           \
      ( CHANNEL == TIM1_Channel_2 ) ||           \
      ( CHANNEL == TIM1_Channel_3 ) )
/* TIM1 Clock Division CKD --------------------------------------------------*/
#define TIM1_CKD_DIV1    ( ( u16 ) 0x0000 )
#define TIM1_CKD_DIV2    ( ( u16 ) 0x0100 )
#define TIM1_CKD_DIV4    ( ( u16 ) 0x0200 )

#define IS_TIM1_CKD_DIV( DIV )    \
    ( ( DIV == TIM1_CKD_DIV1 ) || \
      ( DIV == TIM1_CKD_DIV2 ) || \
      ( DIV == TIM1_CKD_DIV4 ) )

/* TIM1 Counter Mode --------------------------------------------------------*/
#define TIM1_CounterMode_Up                ( ( u16 ) 0x0000 )
#define TIM1_CounterMode_Down              ( ( u16 ) 0x0010 )
#define TIM1_CounterMode_CenterAligned1    ( ( u16 ) 0x0020 )
#define TIM1_CounterMode_CenterAligned2    ( ( u16 ) 0x0040 )
#define TIM1_CounterMode_CenterAligned3    ( ( u16 ) 0x0060 )

#define IS_TIM1_COUNTER_MODE( MODE )                 \
    ( ( MODE == TIM1_CounterMode_Up ) ||             \
      ( MODE == TIM1_CounterMode_Down ) ||           \
      ( MODE == TIM1_CounterMode_CenterAligned1 ) || \
      ( MODE == TIM1_CounterMode_CenterAligned2 ) || \
      ( MODE == TIM1_CounterMode_CenterAligned3 ) )

/* TIM1 Output Compare Polarity ---------------------------------------------*/
#define TIM1_OCPolarity_High    ( ( u16 ) 0x0000 )
#define TIM1_OCPolarity_Low     ( ( u16 ) 0x0001 )

#define IS_TIM1_OC_POLARITY( POLARITY )       \
    ( ( POLARITY == TIM1_OCPolarity_High ) || \
      ( POLARITY == TIM1_OCPolarity_Low ) )

/* TIM1 Output Compare N Polarity -------------------------------------------*/
#define TIM1_OCNPolarity_High    ( ( u16 ) 0x0000 )
#define TIM1_OCNPolarity_Low     ( ( u16 ) 0x0001 )

