FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32F103_IAR/STM32F10xFWLib/inc/stm32f10x_tim1.h
/* TIM1 DMA sources ---------------------------------------------------------*/
#define TIM1_DMA_Update     ( ( u16 ) 0x0100 )
#define TIM1_DMA_CC1        ( ( u16 ) 0x0200 )
#define TIM1_DMA_CC2        ( ( u16 ) 0x0400 )
#define TIM1_DMA_CC3        ( ( u16 ) 0x0800 )
#define TIM1_DMA_CC4        ( ( u16 ) 0x1000 )
#define TIM1_DMA_COM        ( ( u16 ) 0x2000 )
#define TIM1_DMA_Trigger    ( ( u16 ) 0x4000 )

#define IS_TIM1_DMA_SOURCE( SOURCE )    ( ( ( SOURCE & ( u16 ) 0x80FF ) == 0x0000 ) && ( SOURCE != 0x0000 ) )

/* TIM1 External Trigger Prescaler ------------------------------------------*/
#define TIM1_ExtTRGPSC_OFF     ( ( u16 ) 0x0000 )
#define TIM1_ExtTRGPSC_DIV2    ( ( u16 ) 0x1000 )
#define TIM1_ExtTRGPSC_DIV4    ( ( u16 ) 0x2000 )
#define TIM1_ExtTRGPSC_DIV8    ( ( u16 ) 0x3000 )

#define IS_TIM1_EXT_PRESCALER( PRESCALER )    \
    ( ( PRESCALER == TIM1_ExtTRGPSC_OFF ) ||  \
      ( PRESCALER == TIM1_ExtTRGPSC_DIV2 ) || \
      ( PRESCALER == TIM1_ExtTRGPSC_DIV4 ) || \
      ( PRESCALER == TIM1_ExtTRGPSC_DIV8 ) )

/* TIM1 Internal Trigger Selection ------------------------------------------*/
#define TIM1_TS_ITR0       ( ( u16 ) 0x0000 )
#define TIM1_TS_ITR1       ( ( u16 ) 0x0010 )
#define TIM1_TS_ITR2       ( ( u16 ) 0x0020 )
#define TIM1_TS_ITR3       ( ( u16 ) 0x0030 )
#define TIM1_TS_TI1F_ED    ( ( u16 ) 0x0040 )
#define TIM1_TS_TI1FP1     ( ( u16 ) 0x0050 )
#define TIM1_TS_TI2FP2     ( ( u16 ) 0x0060 )
#define TIM1_TS_ETRF       ( ( u16 ) 0x0070 )

#define IS_TIM1_TRIGGER_SELECTION( SELECTION ) \
    ( ( SELECTION == TIM1_TS_ITR0 ) ||         \
      ( SELECTION == TIM1_TS_ITR1 ) ||         \
      ( SELECTION == TIM1_TS_ITR2 ) ||         \
      ( SELECTION == TIM1_TS_ITR3 ) ||         \
      ( SELECTION == TIM1_TS_TI1F_ED ) ||      \
      ( SELECTION == TIM1_TS_TI1FP1 ) ||       \
      ( SELECTION == TIM1_TS_TI2FP2 ) ||       \
      ( SELECTION == TIM1_TS_ETRF ) )

#define IS_TIM1_INTERNAL_TRIGGER_SELECTION( SELECTION ) \
    ( ( SELECTION == TIM1_TS_ITR0 ) ||                  \
      ( SELECTION == TIM1_TS_ITR1 ) ||                  \
      ( SELECTION == TIM1_TS_ITR2 ) ||                  \
      ( SELECTION == TIM1_TS_ITR3 ) )

#define IS_TIM1_TIX_TRIGGER_SELECTION( SELECTION ) \
    ( ( SELECTION == TIM1_TS_TI1F_ED ) ||          \
      ( SELECTION == TIM1_TS_TI1FP1 ) ||           \
      ( SELECTION == TIM1_TS_TI2FP2 ) )

/* TIM1 External Trigger Polarity -------------------------------------------*/
#define TIM1_ExtTRGPolarity_Inverted       ( ( u16 ) 0x8000 )
#define TIM1_ExtTRGPolarity_NonInverted    ( ( u16 ) 0x0000 )

#define IS_TIM1_EXT_POLARITY( POLARITY )              \
    ( ( POLARITY == TIM1_ExtTRGPolarity_Inverted ) || \
      ( POLARITY == TIM1_ExtTRGPolarity_NonInverted ) )

/* TIM1 Prescaler Reload Mode -----------------------------------------------*/
#define TIM1_PSCReloadMode_Update       ( ( u16 ) 0x0000 )
#define TIM1_PSCReloadMode_Immediate    ( ( u16 ) 0x0001 )

#define IS_TIM1_PRESCALER_RELOAD( RELOAD )       \
    ( ( RELOAD == TIM1_PSCReloadMode_Update ) || \
      ( RELOAD == TIM1_PSCReloadMode_Immediate ) )

/* TIM1 Forced Action -------------------------------------------------------*/
#define TIM1_ForcedAction_Active      ( ( u16 ) 0x0050 )
#define TIM1_ForcedAction_InActive    ( ( u16 ) 0x0040 )

#define IS_TIM1_FORCED_ACTION( ACTION )         \
    ( ( ACTION == TIM1_ForcedAction_Active ) || \
      ( ACTION == TIM1_ForcedAction_InActive ) )

/* TIM1 Encoder Mode --------------------------------------------------------*/
#define TIM1_EncoderMode_TI1     ( ( u16 ) 0x0001 )
#define TIM1_EncoderMode_TI2     ( ( u16 ) 0x0002 )
#define TIM1_EncoderMode_TI12    ( ( u16 ) 0x0003 )

#define IS_TIM1_ENCODER_MODE( MODE )      \
    ( ( MODE == TIM1_EncoderMode_TI1 ) || \
      ( MODE == TIM1_EncoderMode_TI2 ) || \
      ( MODE == TIM1_EncoderMode_TI12 ) )

/* TIM1 Event Source --------------------------------------------------------*/
#define TIM1_EventSource_Update     ( ( u16 ) 0x0001 )
#define TIM1_EventSource_CC1        ( ( u16 ) 0x0002 )
#define TIM1_EventSource_CC2        ( ( u16 ) 0x0004 )
#define TIM1_EventSource_CC3        ( ( u16 ) 0x0008 )
#define TIM1_EventSource_CC4        ( ( u16 ) 0x0010 )
#define TIM1_EventSource_COM        ( ( u16 ) 0x0020 )
#define TIM1_EventSource_Trigger    ( ( u16 ) 0x0040 )
#define TIM1_EventSource_Break      ( ( u16 ) 0x0080 )

#define IS_TIM1_EVENT_SOURCE( SOURCE )    ( ( ( SOURCE & ( u16 ) 0xFF00 ) == 0x0000 ) && ( SOURCE != 0x0000 ) )


/* TIM1 Update Source -------------------------------------------------------*/
#define TIM1_UpdateSource_Global     ( ( u16 ) 0x0000 )
#define TIM1_UpdateSource_Regular    ( ( u16 ) 0x0001 )

#define IS_TIM1_UPDATE_SOURCE( SOURCE )         \
    ( ( SOURCE == TIM1_UpdateSource_Global ) || \
      ( SOURCE == TIM1_UpdateSource_Regular ) )

/* TIM1 Ouput Compare Preload State ------------------------------------------*/
#define TIM1_OCPreload_Enable     ( ( u16 ) 0x0001 )
#define TIM1_OCPreload_Disable    ( ( u16 ) 0x0000 )

#define IS_TIM1_OCPRELOAD_STATE( STATE )    \
    ( ( STATE == TIM1_OCPreload_Enable ) || \
      ( STATE == TIM1_OCPreload_Disable ) )

/* TIM1 Ouput Compare Fast State ---------------------------------------------*/
#define TIM1_OCFast_Enable     ( ( u16 ) 0x0001 )
#define TIM1_OCFast_Disable    ( ( u16 ) 0x0000 )

#define IS_TIM1_OCFAST_STATE( STATE )    \
    ( ( STATE == TIM1_OCFast_Enable ) || \
      ( STATE == TIM1_OCFast_Disable ) )

/* TIM1 Trigger Output Source -----------------------------------------------*/
#define TIM1_TRGOSource_Reset     ( ( u16 ) 0x0000 )
#define TIM1_TRGOSource_Enable    ( ( u16 ) 0x0010 )
#define TIM1_TRGOSource_Update    ( ( u16 ) 0x0020 )
#define TIM1_TRGOSource_OC1       ( ( u16 ) 0x0030 )
#define TIM1_TRGOSource_OC1Ref    ( ( u16 ) 0x0040 )
#define TIM1_TRGOSource_OC2Ref    ( ( u16 ) 0x0050 )
#define TIM1_TRGOSource_OC3Ref    ( ( u16 ) 0x0060 )
#define TIM1_TRGOSource_OC4Ref    ( ( u16 ) 0x0070 )

#define IS_TIM1_TRGO_SOURCE( SOURCE )         \
    ( ( SOURCE == TIM1_TRGOSource_Reset ) ||  \
      ( SOURCE == TIM1_TRGOSource_Enable ) || \
      ( SOURCE == TIM1_TRGOSource_Update ) || \
      ( SOURCE == TIM1_TRGOSource_OC1 ) ||    \
      ( SOURCE == TIM1_TRGOSource_OC1Ref ) || \
      ( SOURCE == TIM1_TRGOSource_OC2Ref ) || \
      ( SOURCE == TIM1_TRGOSource_OC3Ref ) || \
      ( SOURCE == TIM1_TRGOSource_OC4Ref ) )

/* TIM1 Slave Mode ----------------------------------------------------------*/
#define TIM1_SlaveMode_Reset        ( ( u16 ) 0x0004 )
#define TIM1_SlaveMode_Gated        ( ( u16 ) 0x0005 )
#define TIM1_SlaveMode_Trigger      ( ( u16 ) 0x0006 )
#define TIM1_SlaveMode_External1    ( ( u16 ) 0x0007 )

#define IS_TIM1_SLAVE_MODE( MODE )          \
    ( ( MODE == TIM1_SlaveMode_Reset ) ||   \
      ( MODE == TIM1_SlaveMode_Gated ) ||   \
      ( MODE == TIM1_SlaveMode_Trigger ) || \
      ( MODE == TIM1_SlaveMode_External1 ) )

/* TIM1 TIx External Clock Source -------------------------------------------*/
#define TIM1_TIxExternalCLK1Source_TI1      ( ( u16 ) 0x0050 )
#define TIM1_TIxExternalCLK1Source_TI2      ( ( u16 ) 0x0060 )
#define TIM1_TIxExternalCLK1Source_TI1ED    ( ( u16 ) 0x0040 )

#define IS_TIM1_TIXCLK_SOURCE( SOURCE )               \
    ( ( SOURCE == TIM1_TIxExternalCLK1Source_TI1 ) || \
      ( SOURCE == TIM1_TIxExternalCLK1Source_TI2 ) || \
      ( SOURCE == TIM1_TIxExternalCLK1Source_TI1ED ) )

/* TIM1 Master Slave Mode ---------------------------------------------------*/
#define TIM1_MasterSlaveMode_Enable     ( ( u16 ) 0x0001 )
#define TIM1_MasterSlaveMode_Disable    ( ( u16 ) 0x0000 )

#define IS_TIM1_MSM_STATE( STATE )                \
    ( ( STATE == TIM1_MasterSlaveMode_Enable ) || \
      ( STATE == TIM1_MasterSlaveMode_Disable ) )

/* TIM1 Flags ---------------------------------------------------------------*/
#define TIM1_FLAG_Update     ( ( u16 ) 0x0001 )
#define TIM1_FLAG_CC1        ( ( u16 ) 0x0002 )
#define TIM1_FLAG_CC2        ( ( u16 ) 0x0004 )
#define TIM1_FLAG_CC3        ( ( u16 ) 0x0008 )
#define TIM1_FLAG_CC4        ( ( u16 ) 0x0010 )
#define TIM1_FLAG_COM        ( ( u16 ) 0x0020 )
#define TIM1_FLAG_Trigger    ( ( u16 ) 0x0040 )
#define TIM1_FLAG_Break      ( ( u16 ) 0x0080 )
#define TIM1_FLAG_CC1OF      ( ( u16 ) 0x0200 )
#define TIM1_FLAG_CC2OF      ( ( u16 ) 0x0400 )
#define TIM1_FLAG_CC3OF      ( ( u16 ) 0x0800 )
#define TIM1_FLAG_CC4OF      ( ( u16 ) 0x1000 )

