FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32F103_IAR/STM32F10xFWLib/inc/stm32f10x_tim1.h
#define IS_TIM1_GET_FLAG( FLAG )       \
    ( ( FLAG == TIM1_FLAG_Update ) ||  \
      ( FLAG == TIM1_FLAG_CC1 ) ||     \
      ( FLAG == TIM1_FLAG_CC2 ) ||     \
      ( FLAG == TIM1_FLAG_CC3 ) ||     \
      ( FLAG == TIM1_FLAG_CC4 ) ||     \
      ( FLAG == TIM1_FLAG_COM ) ||     \
      ( FLAG == TIM1_FLAG_Trigger ) || \
      ( FLAG == TIM1_FLAG_Break ) ||   \
      ( FLAG == TIM1_FLAG_CC1OF ) ||   \
      ( FLAG == TIM1_FLAG_CC2OF ) ||   \
      ( FLAG == TIM1_FLAG_CC3OF ) ||   \
      ( FLAG == TIM1_FLAG_CC4OF ) )

#define IS_TIM1_CLEAR_FLAG( FLAG )    ( ( ( FLAG & ( u16 ) 0xE100 ) == 0x0000 ) && ( FLAG != 0x0000 ) )


/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

void TIM1_DeInit( void );
void TIM1_TimeBaseInit( TIM1_TimeBaseInitTypeDef * TIM1_TimeBaseInitStruct );
void TIM1_OC1Init( TIM1_OCInitTypeDef * TIM1_OCInitStruct );
void TIM1_OC2Init( TIM1_OCInitTypeDef * TIM1_OCInitStruct );
void TIM1_OC3Init( TIM1_OCInitTypeDef * TIM1_OCInitStruct );
void TIM1_OC4Init( TIM1_OCInitTypeDef * TIM1_OCInitStruct );
void TIM1_BDTRConfig( TIM1_BDTRInitTypeDef * TIM1_BDTRInitStruct );
void TIM1_ICInit( TIM1_ICInitTypeDef * TIM1_ICInitStruct );
void TIM1_PWMIConfig( TIM1_ICInitTypeDef * TIM1_ICInitStruct );
void TIM1_TimeBaseStructInit( TIM1_TimeBaseInitTypeDef * TIM1_TimeBaseInitStruct );
void TIM1_OCStructInit( TIM1_OCInitTypeDef * TIM1_OCInitStruct );
void TIM1_ICStructInit( TIM1_ICInitTypeDef * TIM1_ICInitStruct );
void TIM1_BDTRStructInit( TIM1_BDTRInitTypeDef * TIM1_BDTRInitStruct );
void TIM1_Cmd( FunctionalState NewState );
void TIM1_CtrlPWMOutputs( FunctionalState Newstate );
void TIM1_ITConfig( u16 TIM1_IT,
                    FunctionalState NewState );
void TIM1_DMAConfig( u16 TIM1_DMABase,
                     u16 TIM1_DMABurstLength );
void TIM1_DMACmd( u16 TIM1_DMASource,
                  FunctionalState Newstate );
void TIM1_InternalClockConfig( void );
void TIM1_ETRClockMode1Config( u16 TIM1_ExtTRGPrescaler,
                               u16 TIM1_ExtTRGPolarity,
                               u16 ExtTRGFilter );
void TIM1_ETRClockMode2Config( u16 TIM1_ExtTRGPrescaler,
                               u16 TIM1_ExtTRGPolarity,
                               u16 ExtTRGFilter );
void TIM1_ITRxExternalClockConfig( u16 TIM1_InputTriggerSource );
void TIM1_TIxExternalClockConfig( u16 TIM1_TIxExternalCLKSource,
                                  u16 TIM1_ICPolarity,
                                  u8 ICFilter );
void TIM1_SelectInputTrigger( u16 TIM1_InputTriggerSource );
void TIM1_UpdateDisableConfig( FunctionalState Newstate );
void TIM1_UpdateRequestConfig( u8 TIM1_UpdateSource );
void TIM1_SelectHallSensor( FunctionalState Newstate );
void TIM1_SelectOnePulseMode( u16 TIM1_OPMode );
void TIM1_SelectOutputTrigger( u16 TIM1_TRGOSource );
void TIM1_SelectSlaveMode( u16 TIM1_SlaveMode );
void TIM1_SelectMasterSlaveMode( u16 TIM1_MasterSlaveMode );
void TIM1_EncoderInterfaceConfig( u16 TIM1_EncoderMode,
                                  u16 TIM1_IC1Polarity,
                                  u16 TIM1_IC2Polarity );
void TIM1_PrescalerConfig( u16 Prescaler,
                           u16 TIM1_PSCReloadMode );
void TIM1_CounterModeConfig( u16 TIM1_CounterMode );
void TIM1_ForcedOC1Config( u16 TIM1_ForcedAction );
void TIM1_ForcedOC2Config( u16 TIM1_ForcedAction );
void TIM1_ForcedOC3Config( u16 TIM1_ForcedAction );
void TIM1_ForcedOC4Config( u16 TIM1_ForcedAction );
void TIM1_ARRPreloadConfig( FunctionalState Newstate );
void TIM1_SelectCOM( FunctionalState Newstate );
void TIM1_SelectCCDMA( FunctionalState Newstate );
void TIM1_CCPreloadControl( FunctionalState Newstate );
void TIM1_OC1PreloadConfig( u16 TIM1_OCPreload );
void TIM1_OC2PreloadConfig( u16 TIM1_OCPreload );
void TIM1_OC3PreloadConfig( u16 TIM1_OCPreload );
void TIM1_OC4PreloadConfig( u16 TIM1_OCPreload );
void TIM1_OC1FastConfig( u16 TIM1_OCFast );
void TIM1_OC2FastConfig( u16 TIM1_OCFast );
void TIM1_OC3FastConfig( u16 TIM1_OCFast );
void TIM1_OC4FastConfig( u16 TIM1_OCFast );
void TIM1_GenerateEvent( u16 TIM1_EventSource );
void TIM1_OC1PolarityConfig( u16 TIM1_OCPolarity );
void TIM1_OC1NPolarityConfig( u16 TIM1_OCPolarity );
void TIM1_OC2PolarityConfig( u16 TIM1_OCPolarity );
void TIM1_OC2NPolarityConfig( u16 TIM1_OCPolarity );
void TIM1_OC3PolarityConfig( u16 TIM1_OCPolarity );
void TIM1_OC3NPolarityConfig( u16 TIM1_OCPolarity );
void TIM1_OC4PolarityConfig( u16 TIM1_OCPolarity );
void TIM1_CCxCmd( u16 TIM1_Channel,
                  FunctionalState Newstate );
void TIM1_CCxNCmd( u16 TIM1_Channel,
                   FunctionalState Newstate );
void TIM1_SelectOCxM( u16 TIM1_Channel,
                      u16 TIM1_OCMode );
void TIM1_SetAutoreload( u16 Autoreload );
void TIM1_SetCompare1( u16 Compare1 );
void TIM1_SetCompare2( u16 Compare2 );
void TIM1_SetCompare3( u16 Compare3 );
void TIM1_SetCompare4( u16 Compare4 );
void TIM1_SetIC1Prescaler( u16 TIM1_IC1Prescaler );
void TIM1_SetIC2Prescaler( u16 TIM1_IC2Prescaler );
void TIM1_SetIC3Prescaler( u16 TIM1_IC3Prescaler );
void TIM1_SetIC4Prescaler( u16 TIM1_IC4Prescaler );
void TIM1_SetClockDivision( u16 TIM1_CKD );
u16 TIM1_GetCapture1( void );
u16 TIM1_GetCapture2( void );
u16 TIM1_GetCapture3( void );
u16 TIM1_GetCapture4( void );
u16 TIM1_GetCounter( void );
u16 TIM1_GetPrescaler( void );
FlagStatus TIM1_GetFlagStatus( u16 TIM1_FLAG );
void TIM1_ClearFlag( u16 TIM1_Flag );
ITStatus TIM1_GetITStatus( u16 TIM1_IT );
void TIM1_ClearITPendingBit( u16 TIM1_IT );

#endif /*__STM32F10x_TIM1_H */

/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
